ABOUT_TEXT = (
    '📌 Как вести свой WishList?\n\n'
    'Для того чтобы добавить позицию, просто отправьте сообщение боту\n'
    '(текст или ссылку)\n'
    '⚡️1 сообщение = одно желание ⚡\n\n'


    '📌 Желания из WishList можно:\n'
    '1. Отредактировать\n'
    '2. Удалить\n'
    '3. Отправить друзьям\n\n'


    '📌Как посмотреть WishList своего друга?\n'
    'Отправь @username, чей WishList хочешь посмотреть\n\n'

    '📌 Перезапустить бота можно\n'
    'с помощью команды /start'
)

HELLO_TEXT = (
    '🌟 Добро пожаловать в FriendsWishes!\n\n'

    '🚀 Прощайте, заметки '
    'и потерянные ссылки. Добавляйте, управляйте и делитесь желаниями прямо '
    'в мессенджере.\n\n'

    '📲 Начать легко: Отправьте сообщением своё первое желание '
    'или @username друга, чтобы увидеть его WishList.\n\n'

    '💫 FriendsWishes — ваш надежный помощник в мире '
    'желаний. Удачи в создании вашего идеального списка желаний!'
)

SUPPORT_TEXT = (
    'Если вы нашли баг или есть предложения '
    'по улучшению работы бота - пишите разработчику @Crossniros'
)

FRIENDS_LIST_TEXT = 'Отправьте @username друга, чтобы увидеть его WishList'

REGISTRY_REPLY_TEXT = (
    'Вы уже зарегистрированы в нашем боте :)'
)

EMPTY_WISHES_TEXT = 'У вас ещё не добавлено ни одного желания'

GET_MY_WISH_LIST_TEXT = 'Получить мой WishList'
GET_FRIEND_WISH_LIST_TEXT = 'Получить WishList друга'
GET_ABOUT_INFO_TEXT = 'Справка'
GET_HELP_INFO_TEXT = 'Поддержка'
